aschwarm/stm32f4xx_drivers/Src/014i2c_slave_tx_string2.c
/*
 * 013i2c_slave_tx_string.c
 *
 *  Created on: Feb 17, 2025
 *      Author: adams
 */

#include <string.h>
#include "stm32f407xx.h"
#include <stdio.h>


#define SLAVE_ADDR 	0x68
#define MY_ADDR		SLAVE_ADDR

void delay(void)
{
	for(uint32_t i = 0; i < 500000; i++);

}

I2C_Handle_t I2C1Handle;


uint8_t Tx_buf[32] = "STM32 Slave mode testing..";

/*
 * PB6 -> SCL
 * PB7 -> SDA
 */

void I2C1_GPIOInits(void)
{
	GPIO_Handle_t I2CPins;

	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PU;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
	I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;

	//scl
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;

	GPIO_Init(&I2CPins);

	//sda
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;

	GPIO_Init(&I2CPins);

}

void I2C1_Inits(void)
{
	I2C1Handle.pI2Cx = I2C1;
	I2C1Handle.I2C_Config.I2C_ACKControl = I2C_ACK_ENABLE;
	I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDR;
	I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
	I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM;

	I2C_Init(&I2C1Handle);

}

void GPIO_ButtonInit(void)
{
	GPIO_Handle_t GpioBtn;

	GpioBtn.pGPIOx = GPIOA;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;


	GPIO_Init(&GpioBtn);
}

int main()
{
	I2C1_GPIOInits();

	I2C1_Inits();

	GPIO_ButtonInit();

	//I2C IRQ configuration
	I2C_IRQInteruptConfig(IRQ_NO_I2C1_EV, ENABLE);
	I2C_IRQInteruptConfig(IRQ_NO_I2C1_ER, ENABLE);

	I2C_SlaveEnableDisableCallbackEvent(I2C1,ENABLE);

	//enable the i2c peripheral
	I2C_PeripheralControl(I2C1, ENABLE);

	//ack bit is made 1 after PE=1
	I2C_ManageAcking(I2C1,I2C_ACK_ENABLE);

	while(1);

	return 0;
}

void	I2C1_EV_IRQHandler(void)
{
	I2C_EV_IRQHandling(&I2C1Handle);
}

void	I2C1_ER_IRQHandler(void)
{
	I2C_ER_IRQHandling(&I2C1Handle);
}

void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv)
{
	static uint8_t Count = 0;
	static uint8_t commandCode = 0;

	if(AppEv == I2C_EV_DATA_REQ)
	{
		//Master requests data, slave to send data
		if(commandCode == 0x51)
		{
			//send the length information to the master
			I2C_SlaveSendData(pI2CHandle->pI2Cx, strlen((char*)Tx_buf));
		}
		else if(commandCode == 0x52)
		{
			//Send the contents of Tx_buf
			I2C_SlaveSendData(pI2CHandle->pI2Cx,Tx_buf[Count++]);
		}
	}
	else if(AppEv == I2C_EV_DATA_RCV)
	{
		//Data is waiting for the salve to read. Slave has to read data
		commandCode = I2C_SlaveReceiveData(pI2CHandle->pI2Cx);
	}
	else if (AppEv == I2C_ERROR_AF)
	{
		//This happens only during slave Txing
		//Master has sent the NACK. Slave should understand that master doesn't
		//need more data.
		commandCode = 0xff;
		Count = 0;
	}
	else if (AppEv == I2C_EV_STOP)
	{
		//This happens only during slave reception
		//Master has ended I2C communication with the slave.
	}
}




